OpenFOAM-7-master/tutorials/lagrangian/reactingParcelFoam/rivuletPanel/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            fixedFluxPressure;
    }
    sides
    {
        type            fixedFluxPressure;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            fixedFluxPressure;
    }
}

// ************************************************************************* //
